zero-mouse/esp32-camera/sensors/gc032a.c
// Copyright 2015-2021 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdint.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "sccb.h"
#include "gc032a.h"
#include "gc032a_regs.h"
#include "gc032a_settings.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#else
#include "esp_log.h"
static const char *TAG = "gc032a";
#endif

#define H8(v) ((v)>>8)
#define L8(v) ((v)&0xff)

// #define REG_DEBUG_ON
// #define DEBUG_PRINT_REG

static int read_reg(uint8_t slv_addr, const uint16_t reg)
{
    int ret = SCCB_Read(slv_addr, reg);
#ifdef REG_DEBUG_ON
    if (ret < 0) {
        ESP_LOGE(TAG, "READ REG 0x%04x FAILED: %d", reg, ret);
    }
#endif
    return ret;
}

static int write_reg(uint8_t slv_addr, const uint16_t reg, uint8_t value)
{
    int ret = 0;
#ifndef REG_DEBUG_ON
    ret = SCCB_Write(slv_addr, reg, value);
#else
    int old_value = read_reg(slv_addr, reg);
    if (old_value < 0) {
        return old_value;
    }
    if ((uint8_t)old_value != value) {
        ESP_LOGI(TAG, "NEW REG 0x%04x: 0x%02x to 0x%02x", reg, (uint8_t)old_value, value);
        ret = SCCB_Write(slv_addr, reg, value);
    } else {
        ESP_LOGD(TAG, "OLD REG 0x%04x: 0x%02x", reg, (uint8_t)old_value);
        ret = SCCB_Write(slv_addr, reg, value);//maybe not?
    }
    if (ret < 0) {
        ESP_LOGE(TAG, "WRITE REG 0x%04x FAILED: %d", reg, ret);
    }
#endif
    return ret;
}

static int check_reg_mask(uint8_t slv_addr, uint16_t reg, uint8_t mask)
{
    return (read_reg(slv_addr, reg) & mask) == mask;
}

static void print_regs(uint8_t slv_addr)
{
#ifdef DEBUG_PRINT_REG
    vTaskDelay(pdMS_TO_TICKS(100));
    ESP_LOGI(TAG, "REG list look ======================");
    for (size_t i = 0xf0; i <= 0xfe; i++) {
        ESP_LOGI(TAG, "reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
    ESP_LOGI(TAG, "\npage 0 ===");
    write_reg(slv_addr, 0xfe, 0x00); // page 0
    for (size_t i = 0x03; i <= 0x24; i++) {
        ESP_LOGI(TAG, "p0 reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
    for (size_t i = 0x40; i <= 0x95; i++) {
        ESP_LOGI(TAG, "p0 reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
    ESP_LOGI(TAG, "\npage 3 ===");
    write_reg(slv_addr, 0xfe, 0x03); // page 3
    for (size_t i = 0x01; i <= 0x43; i++) {
        ESP_LOGI(TAG, "p3 reg[0x%02x] = 0x%02x", i, read_reg(slv_addr, i));
    }
#endif
}

static int set_reg_bits(uint8_t slv_addr, uint16_t reg, uint8_t offset, uint8_t mask, uint8_t value)
{
    int ret = 0;
    uint8_t c_value, new_value;
    ret = read_reg(slv_addr, reg);
    if (ret < 0) {
        return ret;
    }
    c_value = ret;
    new_value = (c_value & ~(mask << offset)) | ((value & mask) << offset);
    ret = write_reg(slv_addr, reg, new_value);
    return ret;
}

static int write_regs(uint8_t slv_addr, const uint16_t (*regs)[2])
{
    int i = 0, ret = 0;
    while (!ret && regs[i][0] != REGLIST_TAIL) {
        if (regs[i][0] == REG_DLY) {
            vTaskDelay(regs[i][1] / portTICK_PERIOD_MS);
        } else {
            ret = write_reg(slv_addr, regs[i][0], regs[i][1]);
        }
        i++;
    }
    return ret;
}

static int reset(sensor_t *sensor)
{
    int ret;
    // Software Reset: clear all registers and reset them to their default values
    ret = write_reg(sensor->slv_addr, RESET_RELATED, 0xf0);
    if (ret) {
        ESP_LOGE(TAG, "Software Reset FAILED!");
        return ret;
    }
    vTaskDelay(100 / portTICK_PERIOD_MS);

    ret = write_regs(sensor->slv_addr, gc032a_default_regs);
    if (ret == 0) {
        ESP_LOGI(TAG, "Camera defaults loaded");
        vTaskDelay(100 / portTICK_PERIOD_MS);
        write_reg(sensor->slv_addr, 0xfe, 0x00);
        set_reg_bits(sensor->slv_addr, 0xf7, 1, 0x01, 1); // PLL_mode1:div2en
        set_reg_bits(sensor->slv_addr, 0xf7, 7, 0x01, 1); // PLL_mode1:dvp mode
        set_reg_bits(sensor->slv_addr, 0xf8, 0, 0x3f, 8); //PLL_mode2 :divx4
        set_reg_bits(sensor->slv_addr, 0xfa, 4, 0x0f, 2); //vlk div mode :divide_by
    }

    return ret;
}

static int set_pixformat(sensor_t *sensor, pixformat_t pixformat)
{
    int ret = 0;
    switch (pixformat) {
    case PIXFORMAT_RGB565:
        write_reg(sensor->slv_addr, 0xfe, 0x00);
        ret = set_reg_bits(sensor->slv_addr, 0x44, 0, 0x1f, 6);  //RGB565
        break;

    case PIXFORMAT_YUV422:
    case PIXFORMAT_GRAYSCALE:
        write_reg(sensor->slv_addr, 0xfe, 0x00);
        ret = set_reg_bits(sensor->slv_addr, 0x44, 0, 0x1f, 3);
        break;
    default:
        ESP_LOGW(TAG, "unsupported format");
        ret = -1;
        break;
    }
    if (ret == 0) {
        sensor->pixformat = pixformat;
        ESP_LOGD(TAG, "Set pixformat to: %u", pixformat);
    }

    return ret;
}

static int set_framesize(sensor_t *sensor, framesize_t framesize)
{
    ESP_LOGI(TAG, "set_framesize");
    int ret = 0;
    if (framesize > FRAMESIZE_VGA) {
        ESP_LOGW(TAG, "Invalid framesize: %u", framesize);
        framesize = FRAMESIZE_VGA;
    }
    sensor->status.framesize = framesize;
    uint16_t w = resolution[framesize].width;
    uint16_t h = resolution[framesize].height;
    uint16_t row_s = (resolution[FRAMESIZE_VGA].height - h) / 2;
    uint16_t col_s = (resolution[FRAMESIZE_VGA].width - w) / 2;

    write_reg(sensor->slv_addr, 0xfe, 0x00);
    write_reg(sensor->slv_addr, P0_ROW_START_HIGH, H8(row_s)); // Row_start[8]
    write_reg(sensor->slv_addr, P0_ROW_START_LOW, L8(row_s)); // Row_start[7:0]
    write_reg(sensor->slv_addr, P0_COLUMN_START_HIGH, H8(col_s)); // Column_start[9:8]
    write_reg(sensor->slv_addr, P0_COLUMN_START_LOW, L8(col_s)); // Column_start[7:0]
    write_reg(sensor->slv_addr, P0_WINDOW_HEIGHT_HIGH, H8(h + 8)); //window_height [8]
    write_reg(sensor->slv_addr, P0_WINDOW_HEIGHT_LOW, L8(h + 8)); //window_height [7:0]
    write_reg(sensor->slv_addr, P0_WINDOW_WIDTH_HIGH, H8(w + 8)); //window_width [9:8]
    write_reg(sensor->slv_addr, P0_WINDOW_WIDTH_LOW, L8(w + 8)); //window_width [7:0]

    write_reg(sensor->slv_addr, P0_WIN_MODE, 0x01);
    write_reg(sensor->slv_addr, P0_OUT_WIN_HEIGHT_HIGH, H8(h));
    write_reg(sensor->slv_addr, P0_OUT_WIN_HEIGHT_LOW, L8(h));
    write_reg(sensor->slv_addr, P0_OUT_WIN_WIDTH_HIGH, H8(w));
    write_reg(sensor->slv_addr, P0_OUT_WIN_WIDTH_LOW, L8(w));

    if (ret == 0) {
        ESP_LOGD(TAG, "Set framesize to: %ux%u", w, h);
    }
    print_regs(sensor->slv_addr);
    return ret;
}

static int set_hmirror(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.hmirror = enable;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, P0_CISCTL_MODE1, 0, 0x01, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set h-mirror to: %d", enable);
    }
    return ret;
}

static int set_vflip(sensor_t *sensor, int enable)
{
    int ret = 0;
    sensor->status.vflip = enable;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, P0_CISCTL_MODE1, 1, 0x01, enable);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set v-flip to: %d", enable);
    }
    return ret;
}

static int set_colorbar(sensor_t *sensor, int enable)
{
    int ret = 0;
    ret = write_reg(sensor->slv_addr, 0xfe, 0x00);
    ret |= set_reg_bits(sensor->slv_addr, P0_DEBUG_MODE2, 3, 0x01, enable);
    if (ret == 0) {
        sensor->status.colorbar = enable;
        ESP_LOGD(TAG, "Set colorbar to: %d", enable);
    }
    return ret;
}

static int set_gain_ctrl(sensor_t *sensor, int enable)
{
    // GC032A has no separate AGC enable bit; gain is fixed whenever AEC is disabled.
    sensor->status.agc = enable;
    return 0;
}

static int set_agc_gain(sensor_t *sensor, int gain)
{
    // P0:0x70 Global_gain is a full 8-bit gain register (default 0x70).
    // P0:0x48 gain_code is only [3:0] (4-bit, 0-15) — used as a secondary multiplier.
    // We write Global_gain for the primary control.
    //
    // Note this is deliberately asymmetric with get_agc_gain(), which reads Auto_pregain while the
    // AEC is running.  That mirrors the hardware: Global_gain is the manual multiplier, Auto_pregain
    // is the AEC's own output.  Writing here is only meaningful with AEC disabled -- with it on, the
    // AEC drives 0x71/0x72 and this register just scales whatever it decides.
    if (gain < 0)   gain = 0;
    if (gain > 255) gain = 255;

    int ret = write_reg(sensor->slv_addr, 0xfe, 0x00); // select page 0
    ret |= write_reg(sensor->slv_addr, 0x70, (uint8_t)gain); // Global_gain
    if (ret == 0) {
        sensor->status.agc_gain = gain;
        ESP_LOGD(TAG, "Set gain to: %d", gain);
    }
    return ret;
}

static int get_agc_gain(sensor_t *sensor)
{
    write_reg(sensor->slv_addr, 0xfe, 0x00);
    //
    // Which register holds "the gain" depends on who is driving it:
    //
    //   AEC on  - P0:0x71 Auto_pregain is what the AEC actually applies, and it moves.  P0:0x70
    //             Global_gain is a static multiplier the AEC never touches, so reading it reports
    //             a constant (0x50, straight from the init blob) no matter what the sensor is
    //             really doing.  cam_start_frame() calls this per frame to fill fb.gain, so
    //             reading 0x70 made every frame in every event report the same meaningless value.
    //   AEC off - 0x71 is frozen at whatever it last was; 0x70 is what set_agc_gain() wrote.
    //
    // Returning Auto_pregain under AEC also makes fb.gain directly comparable to the
    // AEC_max_pre_dg_gain cap (P1:0x1f), which is how you tell that gain has hit its ceiling.
    //
    return read_reg(sensor->slv_addr, sensor->status.aec ? 0x71 : 0x70);
}

static int set_awb_gain(sensor_t *sensor, int gain)
{
    return -1;
}

static int set_whitebal(sensor_t *sensor, int enable)
{
    return -1;
}

static int set_exposure_ctrl(sensor_t *sensor, int enable)
{
    // Page 0, reg 0x4f bit 0 = AEC enable
    int ret = write_reg(sensor->slv_addr, 0xfe, 0x00); // select page 0
    ret |= set_reg_bits(sensor->slv_addr, 0x4f, 0, 0x01, enable ? 1 : 0);
    if (ret == 0) {
        sensor->status.aec = enable;
        ESP_LOGD(TAG, "Set AEC to: %d", enable);
    }
    return ret;
}

static int set_ae_level(sensor_t *sensor, int level)
{
    // level = exposure time in row periods; 12-bit value: 0x03[3:0] = bits[11:8], 0x04[7:0] = bits[7:0]
    if (level < 0)      level = 0;
    if (level > 0x0fff) level = 0x0fff;

    uint8_t hi = (level >> 8) & 0x0f;
    uint8_t lo = level & 0xff;

    // Seed the manual exposure registers only. The AEC step table (P1:0x27-0x34) is left
    // at factory defaults so the AEC engine retains its full graduated exposure range.
    int ret = write_reg(sensor->slv_addr, 0xfe, 0x00); // page 0
    ret |= write_reg(sensor->slv_addr, P0_EXPOSURE_HIGH, hi);
    ret |= write_reg(sensor->slv_addr, P0_EXPOSURE_LOW,  lo);

    if (ret == 0) {
        sensor->status.ae_level = level;
        ESP_LOGD(TAG, "Set exposure to: %d", level);
    }
    return ret;
}

static int get_ae_level(sensor_t *sensor)
{
    write_reg(sensor->slv_addr, 0xfe, 0x00);
    int hi = read_reg(sensor->slv_addr, P0_EXPOSURE_HIGH);
    int lo = read_reg(sensor->slv_addr, P0_EXPOSURE_LOW);
    if (hi < 0 || lo < 0) return -1;
    return ((hi & 0x0f) << 8) | (lo & 0xff);
}

static int set_gainceiling(sensor_t *sensor, gainceiling_t val)
{
    // P1:0x35-0x3b = AEC_max_dg_gain1-7 (5.3-bit fixed-point: value/8 = gain multiplier).
    // All 7 registers are set to the same ceiling so the AGC is uniformly capped
    // across all exposure levels (which are already pinned to the same value).
    uint8_t ceiling = (uint8_t)val;
    int ret = write_reg(sensor->slv_addr, 0xfe, 0x01); // page 1
    ret |= write_reg(sensor->slv_addr, 0x35, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x36, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x37, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x38, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x39, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x3a, ceiling);
    ret |= write_reg(sensor->slv_addr, 0x3b, ceiling);
    if (ret == 0) {
        sensor->status.gainceiling = (int)val;
        ESP_LOGD(TAG, "Set gain ceiling to: %d", ceiling);
    }
    return ret;
}

static int set_exposure_czone(sensor_t *sensor, int min, int max)
{
    // P1:0x12 = AEC upper brightness target, P1:0x13 = lower brightness target.
    // Analogous to OV7670's AEW (upper) and AEB (lower) registers.
    int ret = write_reg(sensor->slv_addr, 0xfe, 0x01); // page 1
    ret |= write_reg(sensor->slv_addr, 0x12, (uint8_t)max);
    ret |= write_reg(sensor->slv_addr, 0x13, (uint8_t)min);
    return ret;
}

static int set_exposure_szone(sensor_t *sensor, int min, int max)
{
    // GC032A has no fast/slow AEC zone register equivalent to OV7670's VPT.
    return 0;
}

static int get_reg(sensor_t *sensor, int reg, int mask)
{
    int ret = 0;
    if (mask > 0xFF) {
        ESP_LOGE(TAG, "mask should not more than 0xff");
    } else {
        ret = read_reg(sensor->slv_addr, reg);
    }
    if (ret > 0) {
        ret &= mask;
    }
    return ret;
}

static int set_reg(sensor_t *sensor, int reg, int mask, int value)
{
    int ret = 0;
    if (mask > 0xFF) {
        ESP_LOGE(TAG, "mask should not more than 0xff");
    } else {
        ret = read_reg(sensor->slv_addr, reg);
    }
    if (ret < 0) {
        return ret;
    }
    value = (ret & ~mask) | (value & mask);

    if (mask > 0xFF) {

    } else {
        ret = write_reg(sensor->slv_addr, reg, value);
    }
    return ret;
}

static int set_streaming(sensor_t *sensor, int enable)
{
    int ret = 0;
    // GC032A software standby register 0xF3:
    // 0xFF = streaming enabled (normal operation)
    // 0x00 = streaming disabled (software standby)
    ret = write_reg(sensor->slv_addr, SYNC_OUTPUT, enable ? 0xFF : 0x00);
    if (ret == 0) {
        ESP_LOGD(TAG, "Set streaming to: %d", enable);
    }
    return ret;
}

static int init_status(sensor_t *sensor)
{
    write_reg(sensor->slv_addr, 0xfe, 0x00);
    sensor->status.brightness = 0;
    sensor->status.contrast = 0;
    sensor->status.saturation = 0;
    sensor->status.sharpness = 0;
    sensor->status.denoise = 0;
    sensor->status.ae_level = 0;
    sensor->status.gainceiling = 0;
    sensor->status.awb = 0;
    sensor->status.dcw = 0;
    sensor->status.agc = 0;
    sensor->status.aec = 0;
    sensor->status.hmirror = check_reg_mask(sensor->slv_addr, P0_CISCTL_MODE1, 0x01);
    sensor->status.vflip = check_reg_mask(sensor->slv_addr, P0_CISCTL_MODE1, 0x02);
    sensor->status.colorbar = 0;
    sensor->status.bpc = 0;
    sensor->status.wpc = 0;
    sensor->status.raw_gma = 0;
    sensor->status.lenc = 0;
    sensor->status.quality = 0;
    sensor->status.special_effect = 0;
    sensor->status.wb_mode = 0;
    sensor->status.awb_gain = 0;
    sensor->status.agc_gain = 0;
    sensor->status.aec_value = 0;
    sensor->status.aec2 = 0;
    return 0;
}

static int set_dummy(sensor_t *sensor, int val)
{
    ESP_LOGW(TAG, "Unsupported");
    return -1;
}

int esp32_camera_gc032a_detect(int slv_addr, sensor_id_t *id)
{
    if (GC032A_SCCB_ADDR == slv_addr) {
        uint8_t MIDL = SCCB_Read(slv_addr, SENSOR_ID_LOW);
        uint8_t MIDH = SCCB_Read(slv_addr, SENSOR_ID_HIGH);
        uint16_t PID = MIDH << 8 | MIDL;
        if (GC032A_PID == PID) {
            id->PID = PID;
            id->VER = 0;
            id->MIDL = MIDL;
            id->MIDH = MIDH;
            return PID;
        } else {
            ESP_LOGI(TAG, "Mismatch PID=0x%x", PID);
        }
    }
    return 0;
}

int esp32_camera_gc032a_init(sensor_t *sensor)
{
    // Set function pointers
    sensor->reset = reset;
    sensor->init_status = init_status;
    sensor->set_pixformat = set_pixformat;
    sensor->set_framesize = set_framesize;
    sensor->set_colorbar = set_colorbar;
    sensor->set_whitebal = set_whitebal;
    sensor->set_gain_ctrl = set_gain_ctrl;
    sensor->set_exposure_ctrl = set_exposure_ctrl;
    sensor->set_hmirror = set_hmirror;
    sensor->set_vflip = set_vflip;
    sensor->set_ae_level = set_ae_level;
    sensor->get_agc_gain = get_agc_gain;
    sensor->set_awb_gain = set_awb_gain;
    sensor->set_gainceiling = set_gainceiling;

    sensor->set_agc_gain = set_agc_gain;
    sensor->get_ae_level = get_ae_level;

    sensor->set_exposure_czone = set_exposure_czone;
    sensor->set_exposure_szone = set_exposure_szone;

    // not supported
    sensor->set_contrast = set_dummy;
    sensor->set_brightness = set_dummy;
    sensor->set_saturation = set_dummy;
    sensor->set_quality = set_dummy;
    sensor->set_aec2 = set_dummy;
    sensor->set_aec_value = set_dummy;
    sensor->set_special_effect = set_dummy;
    sensor->set_wb_mode = set_dummy;
    sensor->set_dcw = set_dummy;
    sensor->set_bpc = set_dummy;
    sensor->set_wpc = set_dummy;
    sensor->set_raw_gma = set_dummy;
    sensor->set_lenc = set_dummy;
    sensor->set_sharpness = set_dummy;
    sensor->set_denoise = set_dummy;

    // register access
    sensor->get_reg = get_reg;
    sensor->set_reg = set_reg;
    sensor->set_res_raw = NULL;
    sensor->set_pll = NULL;
    sensor->set_xclk = NULL;

    sensor->set_streaming = set_streaming;

    // No autofocus support
    sensor->af_is_supported = NULL;
    sensor->af_init = NULL;
    sensor->af_set_mode = NULL;
    sensor->af_trigger = NULL;
    sensor->af_get_status = NULL;
    sensor->af_set_manual_position = NULL;

    // Retrieve sensor's signature
    sensor->id.MIDH = SCCB_Read(sensor->slv_addr, SENSOR_ID_HIGH);
    sensor->id.MIDL = SCCB_Read(sensor->slv_addr, SENSOR_ID_LOW);
    sensor->id.PID = (sensor->id.MIDH << 8 | sensor->id.MIDL);
    sensor->id.VER = 0;

    ESP_LOGD(TAG, "GC032A Attached");
    return 0;
}
